; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared3 - mode
	thermograph0 - mode
	thermograph1 - mode
	thermograph2 - mode
	Star1 - direction
	Star5 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star0 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star5)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 thermograph1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 infrared3)
	(calibration_target instrument10 Star0)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite0 Planet7)
	(have_image Phenomenon6 thermograph1)
	(have_image Planet7 thermograph2)
	(have_image Planet8 infrared3)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 infrared3)
	(have_image Planet11 infrared3)
))

)

; plan
1. (turn_to satellite2 groundstation2 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 7
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 7
3. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 7
4. (turn_to satellite2 planet11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet11)
   goals met: 0 of 7
5. (take_image satellite2 planet11 instrument5 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon6 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 7
7. (take_image satellite2 phenomenon6 instrument5 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 2 of 7
8. (turn_to satellite2 phenomenon10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 7
9. (take_image satellite2 phenomenon10 instrument5 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 3 of 7
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 7
11. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 3 of 7
12. (turn_to satellite0 planet7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
13. (take_image satellite0 planet7 instrument1 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 5 of 7
14. (turn_to satellite2 planet8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet8)
   goals met: 5 of 7
15. (take_image satellite2 planet8 instrument5 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 6 of 7
16. (turn_to satellite2 star9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star9)
   goals met: 6 of 7
17. (take_image satellite2 star9 instrument5 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 7 of 7
